Revit.GeometryReferences.ElementCurveReference
A stable reference to a Revit curve derived from a Revit Element
See: http://revitapisearch.com.s3-website-us-east-1.amazonaws.com/html/d5e10517-24fa-4627-43be-8981746d30c8.htm

Revit.GeometryReferences.ElementCurveReference.TryGetCurveReference(System.Object,System.String)
Attempt to extract a CurveReference from an object which may be a Revit.References.CurveReference, Revit.Elements.CurveElement, or Revit.Elements.Element
curveObject:
nodeTypeString:
Returns: